{
  "title": "Experience",
  "companies": [
    {
      "name": "Fulltech LTDA",
      "city": "Joinville, SC - Brazil",
      "position": "Full-stack Developer",
      "year": "2020 - Current",
      "companyDescription": "Fulltech is a Fintech focused on the development and application of financial solutions for companies and entrepreneurs. The company works together with BMP Money Plus, a digital bank based in São Paulo, Brazil. As a company, Fulltech guarantees the appropriate technology and infrastructure so that all operations are performed correctly.",
      "roleDescription": "As a Full-stack Developer at Fulltech, I am responsible for creating solutions looking for performance and increasing responsiveness in websites, implementing design principles and their patterns. I also worked writing tests using xUnit for unit tests, Cypress for E2E tests, and some AWS services.",
      "techDescription": "For my current job, I operate using the following tech stack: JavaScript, VueJs, CSS3, C#, .NET Core, API REST, Entity Framework, Dapper, Fluent Validation, DynamoDB, Cosmos DB, MSSQL Server, CQRS, DDD, Azure DevOps, Clean Code, Design Patterns. I also worked with Scrum and Kanban methodologies."
    },
    {
      "name": "Docspider Software S.A",
      "city": "Joinville, SC - Brazil",
      "position": "Full-stack Developer",
      "year": "2018 - 2020",
      "companyDescription": "Docspider is a banking company that's specialized in technologies and services for regulatory governance, compliance, document management, and automation process for business.",
      "roleDescription": "The position of Full-stack Developer at Docspider was my first job, and this position given to me involves working directly on the main product and also in custom projects, where the customer can ask for a customized version of the main product. When I joined the company, I worked on system maintenance, fixing bugs or minor changes reported, and implementing new system features.",
      "techDescription": "During this experience, I was able to work and build solutions using technologies such as JQuery, HTML5, CSS3, JavaScript, C#, ASP.NET Framework, and MSSQL Server."
    }
  ]
}